<?PHP


// http://en.wikipedia.org/wiki/Devanagari_script#Devan.C4.81gar.C4.AB_in_Unicode
// http://en.wikibooks.org/wiki/Windows_Programming/Unicode/Character_reference/0000-0FFF


$v = "્"; // Virama

/* Main arrays */

$num['tra'] = array(
	60 => "0",
	61 => "1",
	62 => "2",
	63 => "3",
	64 => "4",
	65 => "5",
	66 => "6",
	67 => "7",
	68 => "8",
	69 => "9",
);

$main['tra'] = array(

	//20 => "t ", // t end
		
	40 => "'", // apostrophe (avagraha)
	41 => "`", // Latin apostrophe (’)
	42 => "#", // Abbreviation

	200 => "n2a",
	202 => "r2a",
	203 => "Za",

	205 => "*ga",
//	206 => "jJa",
	207 => "*ja",
	208 => "*Da",
	209 => "*da",
	210 => "*ba",
	211 => "fa",

	212 => "qha", 
	213 => "khha",
	214 => "ghha",
	215 => "xa",
	216 => "Dhha",
	217 => "rhha",
	
	116 => "kha",
	115 => "ka",
	118 => "gha",
	117 => "ga",
	119 => "Ga",

	121 => "cha",
	120 => "ca",
	123 => "jha",
	122 => "ja",
	124 => "Ja",

	126 => "Tha",
	125 => "Ta",
	128 => "Dha",
	127 => "Da",
	129 => "Na",

	131 => "tha",
	130 => "ta",
	133 => "dha",
	132 => "da",
	134 => "na",

	136 => "pha",
	135 => "pa",
	138 => "bha",
	137 => "ba",
	139 => "ma",
	
	141 => "Ya",
	140 => "ya",
	142 => "ra",
	143 => "la",
	144 => "va",
	
	145 => "za",
	146 => "Sa",
	147 => "sa",

	199 => "K",
	
	149 => "M",
	150 => "H",
	151 => "~",
	152 => "||", // ||
	153 => "|", // |
	154 => "Q", // Nukta
	155 => "@", // Abbreviation
//	156 => ":", // Udatta
//	157 => ";", // Anudatta (svarita)

	201 => "La",
	
	148 => "ha",
);

$vow['tra'] = array(

	270 => " AE",
	269 => " aE",
	271 => " aO",

	265 => " E",
	266 => " O",

	257 => " R",
	258 => " q",
	259 => " w",
	260 => " W",
	
	261 => " e",
	262 => " ai",
	263 => " o",
	264 => " au",
	
	251 => " a",
	252 => " A",
	253 => " i",
	254 => " I",
	255 => " u",
	256 => " U",

	267 => "oM",
);


$yukta['tra'] = array(

	318 => "AE",
	317 => "aE",
	319 => "aO",
	
	315 => "E",
	316 => "O",

	307 => "R", // joint
	308 => "q", // joint
	309 => "w", // joint
	310 => "W", // joint
	
	311 => "e", // joint
	312 => "ai", // joint
	313 => "o", // joint
	314 => "au", // joint
	
	301 => "a", // joint
	302 => "A", // joint
	303 => "i", // joint
	304 => "I", // joint
	305 => "u", // joint
	306 => "U", // joint


);


$num['scr'] = array(
	60 => "૦", // 0
	61 => "૧", // 1
	62 => "૨", // 2
	63 => "૩", // 3
	64 => "૪", // 4
	65 => "૫", // 5
	66 => "૬", // 6
	67 => "૭", // 7
	68 => "૮", // 8
	69 => "૯", // 9
);

$main['scr'] = array(

	//20 => "ৎ", // t end
	
	40 => "ઽ", // apostrophe (avagraha)
	41 => "’", // Latin apostrophe (’)
	42 => "॰", // Abbreviation

	200 => "ન઼",
	202 => "ર઼",
	203 => "ળ઼",

	205 => "ઁˆગ",
//	206 => "ज्ञ",
	207 => "ઁˆજ",
	208 => "ઁˆડ",
	209 => "ઁˆદ",
	210 => "ઁˆબ",
	211 => "ફ઼",

	212 => "ક઼", 
	213 => "ખ઼",
	214 => "ગ઼",
	215 => "જ઼",
	216 => "ડ઼",
	217 => "ઢ઼",
	
	116 => "ખ", // kha
	115 => "ક", // ka
	118 => "ઘ", // gha
	117 => "ગ", // ga
	119 => "ઙ", // Ga
	
	121 => "છ", // cha
	120 => "ચ", // ca
	123 => "ઝ", // jha
	122 => "જ", // ja
	124 => "ઞ", // Ja
	
	126 => "ઠ", // Tha
	125 => "ટ", // Ta
	128 => "ઢ", // Dha
	127 => "ડ", // Da
	129 => "ણ", // Na
	
	131 => "થ", // tha
	130 => "ત", // ta
	133 => "ધ", // dha
	132 => "દ", // da
	134 => "ન", // na
	
	136 => "ફ", // pha
	135 => "પ", // pa
	138 => "ભ", // bha
	137 => "બ", // ba
	139 => "મ", // ma
	
	141 => "ય઼", // Ya
	140 => "ય", // ya
	142 => "ર", // ra
	143 => "લ", // la
	144 => "વ", // va
	
	145 => "શ", // za
	146 => "ષ", // Sa
	147 => "સ", // sa

	199 => "ઃʼ",
	
	149 => "ં", // M
	150 => "ઃ", // H
	151 => "ઁ", // ~
	152 => "॥", // ||
	153 => "।", // |
	154 => "઼", // . Nukta
	155 => "॰", // Abbreviation
//	156 => "॑", // Udatta
//	157 => "॒", // Anudatta (svarita)
	
	201 => "ળ",

	
	148 => "હ", // ha
);

$vow['scr'] = array(
	
	270 => " ઍˇ",
	269 => " ઍ",
	271 => " ઑ",

	265 => " એ˘",
	266 => " ઓ˘",

	257 => " ઋ", // R
	258 => " ૠ", // q
	259 => " ઌ", // L
	260 => " ૡ", // W 
	
	261 => " એ", // e
	262 => " ઐ", // ai
	263 => " ઓ", // o
	264 => " ઔ", // au
	
	251 => " અ", // a
	252 => " આ", // A
	253 => " ઇ", // i
	254 => " ઈ", // I
	255 => " ઉ", // u
	256 => " ઊ", // U
	
	267 => "ૐ",	
);

$yukta['scr'] = array(
	
	318 => "ૅˇ",
	317 => "ૅ",
	319 => "ૉ",

	315 => "ે˘",
	316 => "ો˘",

	307 => "ૃ", // R joint
	308 => "ૄ", // q joint
	309 => "ૢ", // L joint
	310 => "ૣ", // W  joint
	
	311 => "ે", // e joint
	312 => "ૈ", // ai joint
	313 => "ો", // o joint
	314 => "ૌ", // au joint
	
	301 => "&#8205;", // a joint
	302 => "ા", // A joint
	303 => "િ", // i joint
	304 => "ી", // I joint
	305 => "ુ", // u joint
	306 => "ૂ", // U joint

);

?>